Repository: wkddnjset/K-Global-Starthon
Catalog: Project/Watson API/tmx/deep_learning.tmx
Source language: en
Languages: ko

source: However, the input pattern is because humans have directly determined, must determine by repeated experiment.
ko: 검출 난이도가 높으면서 학습 데이터가 충분하지 않은 전자 부품의 표면 결함 검사에 대해서 딥러닝 접근법의 하나인 CNN을 적용하고 가능성을 검토한다.

source: The factor of power demand prediction was used average temperature, sensible temperature, cooling degree hours, discomfort index.
ko: CNN 기법 외에 Otsu와 Gaussian blur 기법을 CNN에 결합하여 시도하였고, VOV 필터 기반의 데이터 재생성을 통해 데이터를 확충한 기법과 비교하였다.

source: As a result, input pattern power demand and average temperature for one week was obtained the best results about power demand prediction.
ko: 이를 통해 검출 오류율을 5%까지 감소시킨 결과를 얻을 수 있었다.

source: In addition, we were enhanced to more prediction results by adding the sensible temperature and discomfort index elements.
ko: 최근 몇 년간 딥러닝(deep learning)은 음성 인식, 영상 인식, 물체 검출을 비롯한 다양한 패턴인식 분야에서 혁신적인 성능 발전을 거듭해왔다.

source: As future research, proposed model need to build more suitable network for deep learning, and need to use of meteorological elements Big Data to improve power demand prediction
ko: 그에 비해 네트워크가 어떻게 작동하는지에 대한 깊은 이해는 잘 이루어지지 않고 있다.

source: Pedestrian detection, an important component of autonomous driving and driving assistant system, has been extensively studied for many years.
ko: 본 논문은 효과적인 신경망 네트워크를 구성하기 위해 네트워크 파라미터들이 신경망 내부에서 어떻게 작동하고, 어떤 역할을 하고 있는지 분석하였다.

source: In particular, image based pedestrian detection methods such as Hierarchical classifier or HOG and, deep models such as ConvNet are well studied.
ko: Faster R-CNN 네트워크를 기반으로 하여 신경망의 과적합(overfitting)을 막는 드랍아웃(dropout) 확률과 앵커 박스 크기, 그리고 활성 함수를 변화시켜 학습한 후 그 결과를 분석하였다.

source: The evaluation score has increased by the various methods.
ko: 또한 드랍아웃과 배치 정규화(batch normalization) 방식을 비교해보았다.

source: However, pedestrian detection requires high sensitivity to errors, since small error can lead to life or death problems.
ko: 드랍아웃 확률은 0.3일 때 가장 좋은 성능을 보였으며 앵커 박스의 크기는 최종 물체 검출 성능과 큰 관련이 없다는 것을 알 수 있었다.

source: Consequently, further reduction in pedestrian detection error rate of autonomous systems is required.
ko: 드랍아웃과 배치 정규화 방식은 서로를 완전히 대체할 수는 없는 것을 확인할 수 있었다.

source: We proposed a new method to detect pedestrians and reduce the error rate by using the Faster R-CNN with new developed pedestrian training data sets.
ko: 활성화 함수는 음수 도메인의 기울기가 0.02인 leaky ReLU가 비교적 좋은 성능을 보였다.

source: Finally, we compared the proposed method with the previous models, in order to show the improvement of our method.
ko: 온라인 소셜미디어의 등장으로 방대한 사용자 데이터가 수집되고 이는 루머의 탐지와 같은 복잡하고 도전적인 사회 문제를 자료 기반 기법으로 해결할 수 있게끔 한다.

source: In this paper, the copy mechanism and input feeding are applied to recurrent neural network(RNN)-search model in a Korean-document summarization in an end-to-end manner.
ko: 최근 딥러닝 기반 모델들이 이러한 문제를 해결하기 위한 빠르고 정확한 기법 중의 하나로서 소개되었다.

source: In addition, the performances of the document summarizations are compared according to the model and the tokenization format; accordingly, the syllable-unit, morpheme-unit, and hybrid-unit tokenization formats are compared.
ko: 하지만 기존에 제시된 모델들은 전파 종료 후 작동하거나 오랜 관찰기간을 필요로 하여 활용성이 제한된다.

source: For the experiments, Internet newspaper articles were collected to construct a Korean-document summary data set (train set: 30291 documents; development set: 3786 documents; test set: 3705 documents).
ko: 이 연구에서는 초기 소량데이터만을 활용하는 recurrent neural networks (RNNs) 기반의 빠른 루머 분류 알고리즘을 제안한다.

source: When the format was tokenized as the morpheme-unit, the models with the input feeding and the copy mechanism showed the highest performances of ROUGE-1 35.92, ROUGE-215.37, and ROUGE-L 29.45.
ko: 제시된 모델은 소셜미디어 스트림을 시계열 자료로 변환하여 사용하며, 이 때 시계열 데이터는 팔로워 수와 같이 정보 전파자 관련 정보는 물론 주어진 컨텐츠에서 추론한 언어심리학적 감성의 점수로 구성된다.

source: As a 360-degree image carries information of all directions, it often has too much information.
ko: 수백만의 트윗을 포함하는 498개의 실제 루머 및 494개의 비루머 사례 분석을 통해 이 연구는 제안하는 RNN 기반 모델이 초기 30개의 트윗 만으로도 (초기 수시간) 0.74 F1의 높은 성능을 보임을 확인한다.

source: Moreover, in order to investigate a 360-degree image on a 2D display, a user has to either click and drag the image with a mouse, or project it to a 2D panorama image, which inevitably introduces severe distortions.
ko: 이러한 결과는 실제 응용가능한 수준의 빠르고 효율적인 루머 분류 알고리즘 개발의 초석이 된다.

source: In consequence, investigating a 360-degree image and finding an object of interest in such a 360-degree image could be a tedious task.
ko: 최근 스마트 기기의 보급으로 자유롭게 비디오 컨텐츠를 생성하고 이를 빠르고 편리하게 공유할 수 있는 네트워크 환경이 갖추어지면서, 퍼스널 비디오가 급증하고 있다.

source: To resolve this issue, this paper proposes a method to find a region of interest and produces a 2D naturally looking image from a given 360-degree image that best matches a description given by a user in a natural language sentence.
ko: 그러나, 퍼스널 비디오는 비디오라는 특성 상 멀티 모달리티로 구성되어 있으면서 데이터가 시간의 흐름에 따라 변화하기 때문에 이벤트 분류를 할 때 이에 대한 고려가 필요하다.

source: Our method also considers photo composition so that the resulting image is aesthetically pleasing.
ko: 본 논문에서는 비디오 내의 멀티 모달리티들로부터 고수준의 특징을 추출하여 시간 순으로 재배열한 것을 바탕으로 모달리티 사이의 연관관계를 Deep Neural Network(DNN)으로 학습하여 퍼스널 비디오 이벤트를 분류하는 방법을 제안한다.

source: Our method first converts a 360-degree image to a 2D cubemap.
ko: 제안하는 방법은 비디오에 내포된 이미지와 오디오를 시간적으로 동기화하여 추출한 후 GoogLeNet과 Multi-Layer Perceptron(MLP)을 이용하여 각각 고수준 정보를 추출한다.

source: As objects in a 360-degree image may appear distorted or split into multiple pieces in a typical cubemap, leading to failure of detection of such objects, we introduce a modified cubemap.
ko: 그리고 이들을 비디오에 표현된 시간순으로 재 배열하여 비디오 한 편당하나의 특징으로 재 생성하고 이를 바탕으로 학습한 DNN을 이용하여 퍼스널 비디오 이벤트를 분류한다.

source: Then our method applies a Long Short Term Memory (LSTM) network based object detection method to find a region of interest with a given natural language sentence.
ko: 기계학습은 전력계통을 효율적으로 운영할 수 있도록, 에너지 빅 데이터 분석과 전력수요예측을 위한 방법으로 관심을 받고 있다.

source: Finally, our method produces an image that contains the detected region, and also has aesthetically pleasing composition.
ko: 본 논문은 R과 텐서플로우의 기계학습 패키지를 이용하여, 전력수요예측을 위한 딥러닝 입력패턴에 대해서 연구하였다.
